Revit 2027 API
TemporaryViewModes.WorksharingDisplay Property
 The current state of the WorksharingDisplay mode in the associated view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksharingDisplayMode WorksharingDisplay { get; set; }
Public Property WorksharingDisplay As WorksharingDisplayMode
	Get
	Set
public:
property WorksharingDisplayMode WorksharingDisplay {
	WorksharingDisplayMode get ();
	void set (WorksharingDisplayMode value);
}
member WorksharingDisplay : WorksharingDisplayMode with get, set
Property Value
WorksharingDisplayMode
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  When setting this property: The WorksharingDisplay mode is either disabled or inapplicable in the associated view.
See Also
Reference
TemporaryViewModes Class
Autodesk.Revit.DB Namespace